Tekla.Structures.DirectManipulation.Assertion
The Tekla.Structures.DirectManipulation.Assertion class provides the debugging assertion methods.

Tekla.Structures.DirectManipulation.Assertion.AssertCount(System.Int32,System.String,System.String,System.Int32)
Asserts the objects count.
count: The objects count.
memberName: Name of the member.
sourceFilePath: The source file path.
sourceLineNumber: The source line number.